using UnityEngine;

public class AAAAAAAAAAAAAAAAAbh : AAAAAAAAAAAAAAAAbe
{
	public AAAAAAAAAAAAAAAAAbh()
	{
		base.NameSubject = "Данные о происходящем в Зоне";
		base.TextureSubject = (Texture2D)Resources.Load("Sprites/Subject/dokuments_0");
		base.AudioSlot = (AudioClip)Resources.Load("Sound/Suit/inv_ruck");
		base.CostSubject = 1000;
		base.DescriptionSubject = "Видимо, документ заинтересует лидера Чистого Неба";
		base.WeightSubject = 0.01f;
		base.TypeSubj = TypeSubject.QuestSubject;
		base.TextOfDocument = "Полу-документальные данные о происходящем в Зоне\nВ 1986 году ответ на испытания психотропного оружия планетарного масштаба, на территории Америки была проведена ответная акция с использованием тектонического оружия по ЧАЭС, как энергетическому центру военных лабораторий психотропного оружия. Что повлекло за собой аварию на ЧАЭС и выведение из строя на неопределенное... Зона становится закрытым объектом, только в некоторые районы тридцатикилометрового района пускают персонал, делают это для отвода глаз от подземных военных лабораторий, в которых куется оружие... В обстановке строжайшей секретности ведется исследовательская работа в области магнитно-гравитационных полей, психотропных технологий, проводятся многочисленные генетические исследования по выращиванию генетических солдат и бактериологического оружия, разрабатываются новые виды энергии и энергетического оружия. После аварии среди населения пошли слухи о взрыве на секретной научной базе в километре от АЭС, который якобы повлек за собой аварию на станции, будто бы там проводили подземные испытания термоядерного оружия, но эти слухи быстро пресекли, нашли источник утечки информации и обезвредили его. ... временно прекратились, американские спецслужбы сканировали территорию Чернобыльской Зоны с орбиты, но тщетно – базы были под землей, хорошо замаскированные сверху. Эти сверхсекретные объекты почти полностью находились под землей, имели много этажей, лабораторий, складов, соединены лифтами и туннелями, там работала целая армия военных, ученых, обслуживающего персонала и офицеров разведки... произошел развал Советского Союза и отделение Украины. Военные базы оказались без средств к существованию, все первоначальные цели были брошены, под угрозой было существование секретных объектов. Руководство тайной Зоны было вынуждено мириться с волей украинского правительства, от которого было скрыто большая часть исследований, в том числе психотропного оружия. Постепенно родился план по психотропной манипуляции видными политическими деятелями с целью восстановления СССР.Была налажена связь с несколькими тайными организациями, после чего было получено скрытое финансирование и военные лаборатории продолжили свою работу.";
	}
}
