using UnityEngine;

public class AAAAAAAAAAAAAAAAAAAAbs : AAAAAAAAAAAAAAAAbe
{
	public AAAAAAAAAAAAAAAAAAAAbs()
	{
		base.NameSubject = "Посмертная записка руководителя лаборатории";
		base.TextureSubject = (Texture2D)Resources.Load("Sprites/Subject/dokuments_0");
		base.AudioSlot = (AudioClip)Resources.Load("Sound/Suit/inv_ruck");
		base.CostSubject = 1000;
		base.DescriptionSubject = "Посмертная записка руководителя лаборатории. Один из многочисленных документов, интересующих лидера Чистого Неба";
		base.WeightSubject = 0.01f;
		base.TypeSubj = TypeSubject.QuestSubject;
		base.TextOfDocument = "Я, ..., руководитель лаборатории ..., находясь в здравом уме добровольно ухожу из жизни сегодня ... А сейчас просто хочу объяснить причины. Надеюсь, кто - то найдет эту записку и передаст об этом моим близким и коллегам, которым я остался верен до конца. Две недели назад я подписал приказ о консервации нашей лаборатории Х16. После событий 12 апреля лаборатория не могла больше работать в нормальном режиме.Связь с центром была утеряна.Размножив материалы о результатах работы лаборатории я отправил четыре группы своих сотрудников в главную лабораторию. Кто - то из них обязательно дойдет я верю. И бесценные результаты нашей работы не пропадут даром. А пойдут на пользу нашего ВЕЛИКОГО дела. Дальше. Оставшись один, я загрузил в наше детище — псевдо - мозг «Я1 - М» разработанную нами программу «Покров тьмы», которая должна была, по идее, заставить наш комплекс пси-защиты ZX - 16 внушать любому думающему созданию в радиусе 200 метров, абсолютную невидимость нашей лаборатории, а также на подсознательном уровне внушать нежелание кого - бы то ни было приближаться к ней... Вобщем, буду краток. Я не знаю почему. Но заработала не эта программа.Когда я попытался выйти из защищенного от пси-излучения помещения с «мозгом» я получил сокрушительный пси-приказ становиться на защиту объекта и убивать всех непрошеных гостей.Когда я очнулся, то обнаружил себя опять в пси-убежище.Как вернулся, не помню. За последние 2 недели, которые я провел в этой комнате — я тысячи раз спрашивал себя, как могла заработать программа, которую мы только начали разрабатывать? Ответ меня пугает.Возможно, сработала самая фантастическая гипотеза моих коллег о возможности самообучения у Я - 1М.Если так то этот монстр, наверное, хитро ухмыляется сейчас рядом со мной. Я пытался разбить его корпус, но бесполезно. Мой ПМ ничего сделать не может сделать с этим бронестеклом. А все автоматы унесли наши охранники. Отключить комплекс сейчас можно только с резервного пульта управление. Я сам загнал себя в ловушку. Вода и продуты закончились неделю назад. Если я выйду из комнаты — пси - излучение уничтожит меня как личность, и оставшиеся недолгие дни я буду жить жизнью растений. Так не хочу. Поэтому последнюю пулю в своем пистолете я оставил себе.\nВсем удачи... не поминайте лихом, ...\n26 апреля 2008 года. 13 - 40";
	}
}
