using UnityEngine;

public class AAAAAAAAAAAAAAAAAAAAbt : AAAAAAAAAAAAAAAAbe
{
	public AAAAAAAAAAAAAAAAAAAAbt()
	{
		base.NameSubject = "Документ X";
		base.TextureSubject = (Texture2D)Resources.Load("Sprites/Subject/dokuments_0");
		base.AudioSlot = (AudioClip)Resources.Load("Sound/Suit/inv_ruck");
		base.CostSubject = 1000;
		base.DescriptionSubject = "Старый, пожелтевший документ, с плохо сохранившимся текстом. Однозначно, документ заинтересует лидера Чистого Неба";
		base.WeightSubject = 0.01f;
		base.TypeSubj = TypeSubject.QuestSubject;
		base.TextOfDocument = "Документ Х ''О передаче территории вокруг ЧАЭС ...'' Секретной правительственной организации ... сразу после Чернобыльской аварии в 1986 году была передана 10 километровая территория возле ЧАЭС. Ей передали подземные военные лаборатории на этой территории и все данные по психотропным средствам воздействия на психику, также этой организации досталась радио - магнитная антенна «Русский Дятел», для направленного психо – подавления противника. Цель - создание секретного научного центра по разработке высоких технологий электромагнитного обнаружения, сетей наблюдения и слежения, исследований в области вихревых потоков и электромагнитных аномалий в различных районах мира .Кроме того, проведение сверхсекретных проектов «Небо 2», «Прикрытие», разработка средств психотропной защиты и нападения, многочисленные генетические исследования, разработка новых видов энергии…";
	}
}
