using UnityEngine;

public class AAAAAAAAAAAAAAbf : AAAAAAAAAAAAAAAAbe
{
	public AAAAAAAAAAAAAAbf()
	{
		base.NameSubject = "Документ №...";
		base.TextureSubject = (Texture2D)Resources.Load("Sprites/Subject/dokuments_0");
		base.AudioSlot = (AudioClip)Resources.Load("Sound/Suit/inv_ruck");
		base.CostSubject = 1000;
		base.DescriptionSubject = "Старый, пожелтевший документ, с неплохо сохранившимся текстом. Заинтересует лидера Чистого Неба";
		base.WeightSubject = 0.01f;
		base.TypeSubj = TypeSubject.QuestSubject;
		base.TextOfDocument = "Документ №...\n... в 12 часа 00 минут местного времени над территорией зоны отчуждения Чернобыльской АЭС некоторые очевидцы услышали хлопок, как от взрыва шаровой молнии, вслед за которым окрестности в радиусе 10 - 15 километров на 2 - 3 секунды озарило странное белое сияние, не похожее на что-то природное или техногенное земного происхождения.\nПодчиненные начальника электроснабжения зоны А.Тулдышникова поначалу решили, что замкнуло электричество где-то на “точке” в районе Припяти.Днем на автомашине ГАЗ-66 поехали разбираться. Однако, не доезжая километра - полтора до места, двигатель “Газа” неожиданно встал, и все попытки его запустить оказались бесплодными. Вырубились и фары машины, и вся электрика... Когда попытались ближе подойти к тому месту и выяснить причины происходящего, начинало ломить головы и резко ухудшалось общее самочувствие... Сразу смекнули: дело неладно. Привезли стандартный комплект оборудования с ОЗК(общевойсковыми защитными комбинезонами) и приборами ДП - 5 для замера радиации и... обалдели: на расстоянии в полтора километра от места предполагаемого взрыва радиация составляла... 15 - 20 рентген в час!Стали искать источник радиации.Немного спустя, в бинокли рассмотрели поразительную вещь: обугленные останки небольшого здания или бункера, за тремя рядами колючей проволоки. Ближе к бункеру радиация доходила до 30 - 40 рентген в час.Было видно, что полупустынная земля вокруг места взрыва нагрелась до высокой температуры, растрескалась, шел пар. Даже бывалые “вояки” испугались и быстро покинули район во избежание облучения, помчавшись докладывать начальству полигона.\nВ штабе, руководствуясь инструкцией и Методическими указаниями Минобороны(МО Украины) от 1996 года, незамедлительно приняли решение направить шифротелеграмму в специальную войсковую часть города Киева об обнаружении на территории закрытой Зоны сильно облученного объекта. Оттуда был получен быстрый ответ: ждите самолет-лабораторию со спецгруппой из Киева, готовьте аэродром к приему, к объекту не приближайтесь, оцепите район...\nСамолет - лаборатория Ту - 134 прибыл удивительно быстро: тем же утром, всего через несколько часов. Аэродром закрыли. Место происшествия было оперативно оцеплено в радиусе 15 километров.В оцеплении стояли военнослужащие полигона, ближе их не подпускали.";
	}
}
