using UnityEngine;

public class AAAAAAAAAAAAAAAAAbj : AAAAAAAAAAAAAAAAbe
{
	public AAAAAAAAAAAAAAAAAbj()
	{
		base.NameSubject = "Записки сталкера N0003";
		base.TextureSubject = (Texture2D)Resources.Load("Sprites/Subject/dokuments_0");
		base.AudioSlot = (AudioClip)Resources.Load("Sound/Suit/inv_ruck");
		base.CostSubject = 1000;
		base.DescriptionSubject = "Видимо заинтересует лидера Чистого Неба";
		base.WeightSubject = 0.01f;
		base.TypeSubj = TypeSubject.QuestSubject;
		base.TextOfDocument = "Сегодня было 26 июня 2010 года. Несмотря на все прогнозы, Украина так и не вступила в НАТО, и закрыла Зону от всех иностранных спецслужб и военных. Собственные войска, охранявшие зону, не слишком ревностно исполняли свои обязанности. Солдатам-срочникам не платили, и вход на Зону стоил 100 гривен – мелочь для удачливого сталкера, так же как и для шпиона. Впрочем, агенты иностранной разведки не лазили в Зону, они предпочитали довольствоваться рассказами сталкеров, и платили наличными за артефакты, вынесенные оттуда.\nЕсли бы Зона была расположена не в Украине, попасть туда было бы намного сложнее – спецслужбы наглухо отгородили бы её от остального мира. К счастью для сталкеров, этого не произошло, и многие из них ходили в Зону как на работу… Зона любит сюрпризы, и после каждого всплеска активности закрывались одни и открывались другие комариные плеши; пара безвредных холмов становились мясорубкой, и судьба сталкера, попавшего между ними, была незавидна.\nЗона... Она не жалует чужаков, вторгающихся на её территорию. Но существуют способы сделаться «незаметным» для неё. Во - первых, в Зоне нельзя кричать и вообще шуметь. Крики и шум привлекут к вам нежелательных гостей – стражей спокойствия Зоны.Во - вторых, в Зоне нет места эмоциям.Здесь гораздо легче выжить уравновешенному и спокойному человеку, чем неуравновешенному.Зона чувствует, что у человека на душе, и ловушка, сработавшая на человека с нечистой совестью может игнорировать того, чья совесть чиста. В третьих, в Зоне нельзя бежать. Если ловушка захлопнулась – бег не поможет, если же нет – от неё можно спокойно уйти. Вообще все в Зоне подчинено особому ритму, и тому, кто научился вживаться в особую атмосферу этого места нечего бояться – нужно только внимательно глядеть по сторонам.";
	}
}
