using UnityEngine;

public class AAAAAAAAAAAAAAAbc : AAAAAAAAAAAAAAAAbe
{
	public AAAAAAAAAAAAAAAbc()
	{
		base.NameSubject = "Отчет следственной группы";
		base.TextureSubject = (Texture2D)Resources.Load("Sprites/Subject/dokuments_2");
		base.AudioSlot = (AudioClip)Resources.Load("Sound/Suit/inv_ruck");
		base.CostSubject = 1000;
		base.DescriptionSubject = "Старый, пожелтевший документ, с плохо сохранившимся текстом. Такими документами интересовался лидер Чистого Неба";
		base.WeightSubject = 0.01f;
		base.TypeSubj = TypeSubject.QuestSubject;
		base.TextOfDocument = "Отчет следственной группы. Для служебного пользования. \nРуководителю проекта ... От руководителя группы...\nДокладная записка.\nНаша группа в составе ... провела обследование помещений бывшего научно - исследовательского института земледелия на радиоактивно-зараженных почвах НИИ ''Агропром'' .Большинство оборудования и документации исчезли в неизвестном направлении, однако даже то немногое, что удалось найти, позволяет сделать следующий вывод: в период с 2005 по 2008 годы институт научными изысканиями по своему профилю не занимался. Все результаты его ''работ'', полученные Министерством Сельского хозяйства, сфабрикованы. В тоже время, получая под государственные программы финансирование, оборудование и расходные материалы руководство НИИ, в лице доктора Стрижа Петра Даниловича, по липовым накладным переправляло все это в некую лабораторию Х-18 под видом проведения экспериментов в подсобном хозяйстве института. Судя по всему используется кодовое название, принятое у группы лиц проходящих по данному делу, поскольку лаборатории с подобными номером в нашей базе данных нет. Исходя из анализа найденных документов можно предположить, что она находится на расстоянии часа езды на машине от НИИ Агропром. Вероятней всего речь идет о глубоко-законспирированной лаборатории, поэтому предлагаю подключить для ее поиска наш аналитический отдел.Чем занималась эта лаборатория понять из имеющейся информации не представляется возможным.В найденных документах речь идет о небезызвестном профессоре ... и упоминается некая Группа. По моему глубокому убеждению на сей раз мы нашли конец нити и аналитическому отделу будет, чем себя занять. В приложении заархивированный файл с накладными передачи расходных материалов и оборудования в некое подсобное хозяйство института и отрывок переписки...\nКапитан Максименко Д.Ф.";
	}
}
