using UnityEngine;

public class AAAAAAAAAAAAAAbh : AAAAAAAAAAAAAAAAbe
{
	public AAAAAAAAAAAAAAbh()
	{
		base.NameSubject = "Записки сталкера N0001";
		base.TextureSubject = (Texture2D)Resources.Load("Sprites/Subject/dokuments_0");
		base.AudioSlot = (AudioClip)Resources.Load("Sound/Suit/inv_ruck");
		base.CostSubject = 1000;
		base.DescriptionSubject = "Однозначно заинтересует лидера Чистого Неба";
		base.WeightSubject = 0.01f;
		base.TypeSubj = TypeSubject.QuestSubject;
		base.TextOfDocument = "''Черным Монолитом'' назвали тридцатиметровую глыбу черного камня внутри бывшей Чернобыльской АЭС. Как она там появилась, никто не знал. Но, именно, с нее начались глобальные изменения в зоне отчуждения. Сильная радиация, аномальные искажения окружающего мира. Силу «Монолита» признавали все: от ученых до простых смертных. Одни воспринимали его как чужеродный объект, гостя из другого мира, другие называли его «вторым пришествием Бога» и организовывали религиозные секты.\nВсякий уважающий себя сталкер знал несколько историй о нем.Все они действительно были похожи больше на сказки, чем на действительность. Тут мой друг был совершенно прав. Я же относился к этому философски. Например, скажи мне кто в 2005 году, что через год вокруг Чернобыльской АЭС, по ее старым могильникам будут разгуливать зомби, управляемые существами - телепатами, что там будут жить карлики, швыряющие камни на расстояние в несколько метров всего лишь силой мысли, я бы рассмеялся такому человеку в лицо.Сегодня я сам шагаю по Зоне, глотаю антирад, дышу через фильтры и прячусь среди кустов от тех самых зомби.Поэтому рассказ одного сталкера в баре про Черный Монолит, его чудотворных способностях, я воспринимаю как возможную правду.Нет не истину, а всего лишь возможную правду.Но когда умирает близкий, очень близкий человек, даже возможная, ничтожная по вероятности правда о чудесах дает надежду. Надежду на чудо.";
	}
}
