using UnityEngine;

public class AAAAAAAAAAAAAAAAAbg : AAAAAAAAAAAAAAAAbe
{
	public AAAAAAAAAAAAAAAAAbg()
	{
		base.NameSubject = "Отчет об испытаниях";
		base.TextureSubject = (Texture2D)Resources.Load("Sprites/Subject/dokuments_0");
		base.AudioSlot = (AudioClip)Resources.Load("Sound/Suit/inv_ruck");
		base.CostSubject = 1000;
		base.DescriptionSubject = "Отчет об испытаниях блока ZX-16 на запредельных режимах. Текст плохо сохранился, но что-то разобрать еще можно. Видимо, документ заинтересует лидера Чистого Неба";
		base.WeightSubject = 0.01f;
		base.TypeSubj = TypeSubject.QuestSubject;
		base.TextOfDocument = "Секретно Руководителю проекта «Пси-Барьер» ... От руководителя лаборатории Х-16 ...\nИспытания проводились в условиях принудительного заниженния в 2 раза аварийного барьера отключения из - за теплового перегрева. Установка ZX-16 включалась в обычном режиме пси - поля — «Защита периметра». Проведенные испытания показали появление неуправляемых пикообразных всплесков пси-излучения и наведеных полей через 5 - 6 минут непрерывной работы.Сила пси-поля достигала значений на 50 - 60 процентов превышающих расчетные параметры установки. В абсолютных значениях величыны 170—190 psiA. Полученные значения не объясняются теорией Касьянова о наведенных пси - полях, поскольку предполагался результат понижения пси - поля в момент перегрева излучателя. Часть сотрудников считает, что повышение температуры излучателя вследствие перегрева ведет к усилению параметров нейронной активности биомассы псевдо-мозга «Я - 1М» и мозг становится неким ретранслятором пси-излучения, а не только источником пси - волны накачки излучателя. Но данное утверждение требует серьезной экспериментальной проверки, на которую у коллектива не хватает средств.Другие утверждают, что у них после экспериментов едет крыша и они вообще мало что соображают. Это действительно проблема — с частью сотрудников придется в скором времени расстаться. Биоматериалы подвергнутые воздействию пси-полей во время эксперимента к сожалению пришли в негодность по причине необратимых изменений в деятельности мозга и центральной нервной системы.Данные компьютерной томографии и энцефалограммы прилагается в отдельном отчете.Не смотря на неожиданные и непрогнозируемые результаты эксперимента на установке ZX - 16, в целом они очень интересны, поскольку дают права утверждать, что использование пси-излучателя совместно с псевдо - мозгом «Я - 1М» может дать в конечном счете более надежный результат работы системы «Пси - Барьер» нежели аналогичные результаты наших конкурентов из лаборатории Х-19.\n12.12.2007 ...\nP.S.Для продолжения исследований нам необходима новая партия биоматериаллов, в количестве: 10 особей животых и 10 особей человека ... Прошу также прислать дополнительную охрану, поскольку удерживать заключенных после пси-воздействия становится проблематичным. После последнего эксперимента части из них удалось бежать. Во время преследования охране удалось ликвидировать часть из них.Остальных загнали в зону с высокой радиацией и преследование прекратили.";
	}
}
