using UnityEngine;

public class AAAAAAAAAAAAAAAAAbf : AAAAAAAAAAAAAAAAbe
{
	public AAAAAAAAAAAAAAAAAbf()
	{
		base.NameSubject = "Записки персонала лаборатории Х-18";
		base.TextureSubject = (Texture2D)Resources.Load("Sprites/Subject/dokuments_0");
		base.AudioSlot = (AudioClip)Resources.Load("Sound/Suit/inv_ruck");
		base.CostSubject = 1000;
		base.DescriptionSubject = "Старый, пожелтевший документ, с неплохо сохранившимся текстом. Однозначно, документ заинтересует лидера Чистого Неба";
		base.WeightSubject = 0.01f;
		base.TypeSubj = TypeSubject.QuestSubject;
		base.TextOfDocument = "Неделю назад было принято решение повысить интенсивность излучения на подопытных. В первые дни изменений не обнаружено. Спустя несколько дней с ними начались странные метаморфозы: уменьшение волосяного покрова, повышенная агрессивность. Несколько подопытных были буквально затоптаны насмерть своими сородичами. Состояние подопытных стабилизировалось.Волосяной покров составляет около 10 % от первоначального.Заметно выросли когти и зубы.Вспышки активности носят скорее случайный характер и не направлены на себе подобных. Старший лаборант Бурнов А. Н.высказал предположение, что это может свидетельствовать об увеличении интеллекта. Было решено испытать на подопытных пси-излучение новой модуляции. Вчера в эксперименте на подопытных было испробовано пси-излучение новой модуляции. Создалось впечатление, что им просто выжгло мозги. С трудом могу себе представить, как это излучение может подействовать на человека.Мы опробовали все типы излучений.Результаты совпадают с данными из других лабораторий.Эксперимент можно считать завершенным. Думаю, что через неделю мы будем готовы к проведению эксперимента на более крупных существах.\nНачальник охраны: Вчера охранник ради шутки кинул подопытным кусок мяса. Они разорвали и съели его в считанные секунды. После этого несколько особей пытались вырваться из клеток. Так из-за этого лаборанты не смогли взять плановую дозу анализов. Несмотря на то, что оханник поступил необдуманно, предлагаю снабдить обслуживающий персонал пневматическим оружием для самозащиты в случае экстренных ситуаций.\nНачальник охраны: Вчера эксперимент чуть не вышел из под контроля. Вырвалось десятка два подопытных, разнесли в щепки две комнаты лаборатории.Хорошо хоть исследовательский персонал успел закрыться наверху. Нам было приказано зачистить помещение главной лаборатории. В результате лаборатории трое из охранников пострадали от укусов. Надеюсь что с ними все будет нормально. Поскорее бы они закончили свои эксперименты.";
	}
}
