using UnityEngine;

public class AAAAAAAAAAAAAAAAAAAAAbt : AAAAAAAAAAAAAAAAbe
{
	public AAAAAAAAAAAAAAAAAAAAAbt()
	{
		base.NameSubject = "Служебная переписка ученых";
		base.TextureSubject = (Texture2D)Resources.Load("Sprites/Subject/dokuments_0");
		base.AudioSlot = (AudioClip)Resources.Load("Sound/Suit/inv_ruck");
		base.CostSubject = 1000;
		base.DescriptionSubject = "Cлужебная переписка ученых. Текст плохо сохранился, но что-то еще можно разобрать. Такими документами интересовался лидер Чистого Неба";
		base.WeightSubject = 0.01f;
		base.TypeSubj = TypeSubject.QuestSubject;
		base.TextOfDocument = "Как мы и договаривались, отсылаю в наше подопытное хозяйство очередную партию расходных материалов и оборудования для проведения Ваших столь нужных для сельского хозяйства экспериментов. Финансирование экспериментов я провел, как натурные эксперименты по темам нашего института, так что в министерстве проблем не будет. Как идут эксперименты? Я до сих пор нахожусь под впечатлением того, что Вы показали мне в прошлый раз.\nИскренне Ваш, ...\nРуководителю НИИ Агропром, ...\nПремного благодарен, ..., все получили. Мои ребята в восторге от лазерного спектрометра, если бы не Вы, я бы долго пробивал через своих эту модель. Ну а министерство сельского хозяйства, конечно, будет благодарно получить НАШИ результаты... рассмешили старика. Эксперименты идут свои чередом и то, что Вы видели в прошлый раз, меркнет по сравнению с тем что мы уже достигли. Подъезжайте почаще - всегда рад Вас видеть. Тем более что на машине до ''нашего подопытного хозяйства'', как Вы выразились, Вам ехать час, не больше. Да совсем забыл, у меня для Вас новость - в следующий понедельник я буду обсуждать Вашу кандидатуру с Группой. Я думаю, они меня поддержат.\nИскренне Ваш, Проф. ...\n... В.М. От руководителя НИИ Агропром, Доктора аграрных наук ... , спасибо за доверие. Я тронут и постараюсь оправдать его. Участвовать в подобном эксперименте, я думаю, мечтает любой ученый, и, если меня примут в Группу, я буду просто счастлив. Искренне Ваш, ...\nP.S.Я выбил в министерстве два новейших японских широкополосных осциллографа и переправлю их Вам с первой же оказией.";
	}
}
