using UnityEngine;

public class AAAAAAAAAAAAAAAAbh : AAAAAAAAAAAAAAAAbe
{
	public AAAAAAAAAAAAAAAAbh()
	{
		base.NameSubject = "Документ XX312";
		base.TextureSubject = (Texture2D)Resources.Load("Sprites/Subject/dokuments_0");
		base.AudioSlot = (AudioClip)Resources.Load("Sound/Suit/inv_ruck");
		base.CostSubject = 1000;
		base.DescriptionSubject = "Документ заинтересует лидера Чистого Неба";
		base.WeightSubject = 0.01f;
		base.TypeSubj = TypeSubject.QuestSubject;
		base.TextOfDocument = "Обсуждение плана действий в наступившем кризисе.\nПосле развала СССР подземный комплекс был обязан предъявить все наработки, отчитаться перед новой властью и попытаться найти с ней общий язык. Но когда правительственная комиссия прибыла, то для обследования лабораторий им была показана лишь малая часть. Продемонстрированные исследования шокировали комиссию, и их необъявленный вердикт был немедленное закрытие подземных лабораторных комплексов, расформирование штата, суд над руководителями за преступления против человечества. Переговоры комиссии были прослушаны, и руководство в спешке приняло решение облучить всех членов комиссии при помощи экспериментального образца психотропного оружия. Всем было проведено внушение о безобидности и перспективности работы подземного комплекса.\nСтрашный результат проявился чуть позже, когда половина комиссии покончила с собой, а остальные ее члены сошли с ума. Сложившуюся ситуацию замяли и вернулись к ней лишь спустя много лет, когда и было проведено расследование, в ходе которого подозрения пали на лабораторный комплекс.";
	}
}
