using UnityEngine;

public class AAAAAAAAAAAAAAAbd : AAAAAAAAAAAAAAAAbe
{
	public AAAAAAAAAAAAAAAbd()
	{
		base.NameSubject = "Указ N563-01";
		base.TextureSubject = (Texture2D)Resources.Load("Sprites/Subject/dokuments_0");
		base.AudioSlot = (AudioClip)Resources.Load("Sound/Suit/inv_ruck");
		base.CostSubject = 1000;
		base.DescriptionSubject = "Один из документов для Чистого Неба";
		base.WeightSubject = 0.01f;
		base.TypeSubj = TypeSubject.QuestSubject;
		base.TextOfDocument = "Распорядительный документ лаборатории с пояснительной запиской.\nС целью обеспечения большей безопасности и стабильности исследовательской работы (после нескольких печальных инцидентов) было решено провести пси-воздействие третьего рода всем работникам лабораторий, начиная с уборщиц и заканчивая учеными. Всем будут установлены адаптирующиеся пси-блоки, которые не позволят никому срывать операции, бунтовать, воровать данные и устраивать погромы или побеги.\nСообщение...\n...на этой почве возник конфликт между группой ученых, разрабатывающих психотропное оружие, и руководителями проекта «Прикрытие». Ученые не желали оказаться под лучами того оружия, которое сами же разрабатывали.Осознавая, что пси-воздействие дело времени ученые начали обдумывать сложившуюся ситуацию и пришли к плану, освобождающему их от опасности.";
	}
}
