using UnityEngine;

public class AAAAAAAAAAAAAAAAAAcd : AAAAAAAAAAAAAAAAbe
{
	public AAAAAAAAAAAAAAAAAAcd()
	{
		base.NameSubject = "Служебная переписка";
		base.TextureSubject = (Texture2D)Resources.Load("Sprites/Subject/dokuments_0");
		base.AudioSlot = (AudioClip)Resources.Load("Sound/Suit/inv_ruck");
		base.CostSubject = 1000;
		base.DescriptionSubject = "Старый, пожелтевший документ, с частино сохранившимся текстом. Однозначно, документ заинтересует лидера Чистого Неба";
		base.WeightSubject = 0.01f;
		base.TypeSubj = TypeSubject.QuestSubject;
		base.TextOfDocument = "Лично. Начальнику колонии строго режима ...\nКирилл ..., доброго времени суток. Как ваши дела? Необходимо 20 ''овец'' из вашего подсобного хозяйства. Желательно помоложе. Шашлычков понимаете опять сотрудникам захотелось. Сами понимаете работа в радиактивной зоне... нужно людям дать расслабиться... кхе - кхе. Оплату гарантируем. Как всегда вовремя. Транспортировка на нас.\nПроф.... 17. 01. 2008\n..., ну сколько же можно? Ко мне уже собираются комисию из Минздрава прислать из - за такой смертности заключенных пожизненного срока. Я вам очень благодарен, конечно, за вашу благодарность и ее размеры, но я не могу больше присылать людей. Извините, но я боюсь. Искренне Ваш. Начальник колонии строго режима ...\n... Поздно ... Вы ведь прекрасно понимаете, что пришлете мне и эту партию заключенных и будете присылать всякий раз, когда я потребую... Потому как прекрасно понимаете, что если о Ваших делах узнают, то сидеть вам придется с теми людьми, которых Вы к нам на смерть массово завозите. А умирать им приходится тяжело... перестаньте беспокоиться о всяких там министерских проверках. Я уже объяснял Вам неоднократно ... а не то, что какое-то сраное министерство. Так что, расслабьтесь и получайте удовольствие от жизни — с министерством вопрос будет закрыт. Впрочем, как и со всеми другими возможными проверками.\n.... 17. 01. 2008";
	}
}
