using UnityEngine;

public class AAAAAAAAAAAAAAAAAAAAbv : AAAAAAAAAAAAAAAAbe
{
	public AAAAAAAAAAAAAAAAAAAAbv()
	{
		base.NameSubject = "Записка о дневнике";
		base.TextureSubject = (Texture2D)Resources.Load("Sprites/Subject/dokuments_0");
		base.AudioSlot = (AudioClip)Resources.Load("Sound/Suit/inv_ruck");
		base.CostSubject = 1000;
		base.DescriptionSubject = "Заинтересует лидера Чистого Неба";
		base.WeightSubject = 0.01f;
		base.TypeSubj = TypeSubject.QuestSubject;
		base.TextOfDocument = "Был найден распухший от бесконечных вставок и добавлений ежедневник. Толстый кожаный переплет привлек внимание яйцеголовых, которые, будучи воспитанными на классических голливудских фильмах, точно знали – это важный источник информации. Так, впрочем, и оказалось. После счастливого обретения в штабе полетела не одна голова – настоящий «звездопад». Погоны чистили и армейским и милицейским и штабным генералам (сколько меньших чинов тогда полегло посчитать просто невозможно). Кое-кто из ретивых ученых даже стал жертвой несчастного случая. Не понятно, да и не важно сейчас, стало тому причиной нежелание штаба держать под боком бомбу замедленного действия, начиненную смертоносным знанием, либо просто месть старого вояки разжалованного в рядовые. На самом деле дневник был уникальным предметом. Он содержал в себе столько информации о Зоне, сколько нельзя было выжать из всех сталкеров вместе взятых. А учитывая то, что говорили они не охотно… В общем, исследования значительно продвинулись вперед. Карта окрестностей реактора пополнилась не одной интересной отметкой. Однако самое интересное началось, когда из Москвы пришла депеша в ответ на запрос штаба о ситуации (к запросу была приложена ксерокопия дневника в полном объеме). «Распоряжение. В течение 3-х дней ликвидировать лиц, контактировавших с дневником. Через 48 часов в Чернобыль прибывает особая комиссия. К этому сроку подготовить к отправке в Москву всех, кто имел контакты до 3 степени включительно с Королевой Оксаной Федоровной и Демокисом Кириллом Игнатьевичем». Сами военные понимали, что дело пахнет керосином. И даже самые высшие руководящие чины не любили «ангелов», тем более, московских. Сталкерам посоветовали, от греха, укрыться в Зоне. Объяснять никому ничего не пришлось.\nМолодой парень, похожий на измученного жизнью старика сидел на ступенях подземной лаборатории, обхватив голову руками. Рядом на полу лежал дневник, открытый где-то по середине. Карандашом с боку значилась еле заметная надпись.\n«Я надеюсь Киря меня простит, простят немногие друзья… … Прости, Колюня, прости, перед тобой я виновата больше всех»\n«А ведь у меня даже пистолета нет» – подумал про себя Петров и стал смеяться долго истерично, захлебываясь горловыми спазмами.\nВечером из Москвы выписали нового специалиста. Запрос отправили самолетом, вместе с комиссией.И ящичком. Ящичек охраняли три «ангела», из самых верхних спецов. Внутри он был покрыт двумя слоями свинца.Лежал там дневник Оксаны Королевой.В сопровождении значилось. «Совершенно секретно. Конвой по прибытии ликвидировать. Экипаж самолета подвергнуть жесткой психотропной обработке. Артефакт № 460.Объект с отрицательной степенью аномальной светимости»";
	}
}
