using UnityEngine;

public class AAAAAAAAAAAAAAAAAbi : AAAAAAAAAAAAAAAAbe
{
	public AAAAAAAAAAAAAAAAAbi()
	{
		base.NameSubject = "Записи М.А.Мизенгора";
		base.TextureSubject = (Texture2D)Resources.Load("Sprites/Subject/dokuments_0");
		base.AudioSlot = (AudioClip)Resources.Load("Sound/Suit/inv_ruck");
		base.CostSubject = 1000;
		base.DescriptionSubject = "Документ заинтересует лидера Чистого Неба";
		base.WeightSubject = 0.01f;
		base.TypeSubj = TypeSubject.QuestSubject;
		base.TextOfDocument = "Сохраненные записи доклада руководителя лаборатории по исследованию мозга, профессора М.А.Мизенгора.\nМы должны уничтожить всю информацию о проводившихся исследованиях и экспериментах. Мы уже далеко не те зеленые юнцы, которые начинали здесь свою работу. Бесчисленные эксперименты и операции, кропотливая работа, часто неблагодарная. Сложности с секретными доступами, когда лишь руководитель знает о том, что делается. Сейчас другое время и нас не поймут те, кто раньше относился к нам благосклонно. Для обычных людей мы чудовища. Да, мы проводили, подчас бесчеловечные эксперименты, как над животными, так и над людьми. Но, надо всегда помнить, ради кого и чего мы боролись, и, невзирая на иногда невыносимые условия работы, мы продолжали свою нужную родине работу. К сожалению, сейчас трудное для нас время и наши ответные действия должны быть такими же жесткими, как и условия в которых мы оказались. Мы должны стать учеными-отшельниками, отрезав мир от себя. Времени мало, СССР больше нет, за наши преступные эксперименты нас будут судить. Рано или поздно правда откроется по тем документам, которые находятся в архивах КГБ и секретных правительственных организаций курирующих научные разработки нового оружия. Дальше слово предоставляется профессору Донцову...";
	}
}
