using UnityEngine;

public class AAAAAAAAAAAAAAAAAAAAAbv : AAAAAAAAAAAAAAAAbe
{
	public AAAAAAAAAAAAAAAAAAAAAbv()
	{
		base.NameSubject = "Газетная вырезка";
		base.TextureSubject = (Texture2D)Resources.Load("Sprites/Subject/dokuments_0");
		base.AudioSlot = (AudioClip)Resources.Load("Sound/Suit/inv_ruck");
		base.CostSubject = 1000;
		base.DescriptionSubject = "Видимо заинтересует лидера Чистого Неба";
		base.WeightSubject = 0.01f;
		base.TypeSubj = TypeSubject.QuestSubject;
		base.TextOfDocument = "Газета «Эхо Чернобыля». № 9 (430) от 24 июня 2012 г.\nЗона снова наступает! Вчера вечером она отвоевала радиус тридцать километров вокруг города Варовска, что находиться на краю Чернобыльской Зоны. Все жители города и окрестных деревень были успешно эвакуированы военными подразделениями. Таким образом, территория отчуждения занимает сейчас несколько тысяч квадратных километров. Мне удалось поговорить с одним из ученых, утверждающим, что он видел всю предысторию событий:\n- Дорогой Арнольд Николаевич!Как так получилось, что территория заражения, в простонародье именуемая Зона разрослась так быстро и так далеко от эпицентра ?\n- Видите ли, дело в том, что флуктуационные поля постоянно перемещаются по Зоне и именно они влияют на происхождение аномальных явлений. Видимо, такое довольно мощное поле оказалось вблизи Варовска и поэтому произошел достаточно мощный выброс чужеродной энергии, который и поглотил такую большую территорию.\n- Спасибо, профессор. Не могли бы вы сказать, существует возможность повторного выброса такой мощности?\n- Ну - у, голубчик, теоретически, нет, конечно. Но, как мы убедились сами, теория разительно отличается от практики. Сказать об этом можно будет только после серьезных наблюдений за деятельностью внутри Зоны.\nИтак, дорогие читатели, ученые не имеют представления, что же это такое, куда уж нам с вами, простым смертным. Подробности интервью в следующем номере!";
	}
}
