using UnityEngine;

public class AAAAAAAAAAAAAAbe : AAAAAAAAAAAAAAAAbe
{
	public AAAAAAAAAAAAAAbe()
	{
		base.NameSubject = "Ответ на отчет об испытаниях";
		base.TextureSubject = (Texture2D)Resources.Load("Sprites/Subject/dokuments_0");
		base.AudioSlot = (AudioClip)Resources.Load("Sound/Suit/inv_ruck");
		base.CostSubject = 1000;
		base.DescriptionSubject = "Отчет об испытаниях блока ZX-16 на запредельных режимах. Текст плохо сохранился, но что-то разобрать еще можно. Видимо, документ заинтересует лидера Чистого Неба";
		base.WeightSubject = 0.01f;
		base.TypeSubj = TypeSubject.QuestSubject;
		base.TextOfDocument = "Ответ на «Отчет об испытаниях блока ZX-16 на запредельных режимах.»\nРуководителю лаборатории Х - 16 ...\n..., по-моему после экспериментов с головой не в порядке не только у части сотрудников, но и у Вас лично. Экспериментатор хренов!!! Кто давал разрешение на прогонку комплекса «мозг - излучатель» в нерасчетных условиях? В инструкции черным по белому написано «строго запрещено повышать мощность пси - излучения выше 120 psiA.» Вы что про ЭТО забыли? Черт подери! В результате Вы потеряли контроль над биоматериалом и более того — дали ему сбежать. Вы понимаете, с каким трудом мне удается добывать заключенных для экспериментов? Вы понимаете, ЧЕМ чревато, если КТО-НИБУДЬ пронюхает о наших экспериментах? Надеюсь что понимаете. Поэтому прошу на будущее не делать ничего подобного без уведомления меня лично. Я понимаю желание молодого ученого обогнать своих конкурентов, но не теряйте головы. Кстати о конкурентах. Лаборатория Х-19 на своей установке вчера получили устойчивую работу пси-излучателей всего с ДВУМЯ отключениями на охлаждение в сутки. С 8 - 30 до 9 - 45 утром и с 20 - 12 до 21 - 00 вечером.Поэтому сравнение с Вашим режимом(5 мин.работаем −3 мин.отдыхаем) явно не в пользу установки вашей лаборатории. Пси - Барьер должен работать надежно и без всяких дыр во времени.Впрочем не хочу Вас расстраивать, я тоже считаю что комплекс «\u00a0псевдо - мозг — пси - излучатель» более прогрессивен, интелектуален и за ним будущее. Но, защитный барьер нужен уже сейчас, так что на первых порах вероятней всего использование полностью техногенного варианта ваших коллег из Х - 19. Да, он работает как кувалда — бах и мозгов нет. Зато, как говорится, «бэз шуму и пыли», дешево и сердито.\nПередавайте мои поздравления коллективу лаборатории с наступающим Новым годом и Рождеством.\n... 20.12.2007\nP.S.О поставках биоматериаллов я договорюсь в ближайшее время.";
	}
}
