using UnityEngine;

public class AAAAAAAAAAAAAAAbe : AAAAAAAAAAAAAAAAbe
{
	public AAAAAAAAAAAAAAAbe()
	{
		base.NameSubject = "Записки сталкера N0002";
		base.TextureSubject = (Texture2D)Resources.Load("Sprites/Subject/dokuments_0");
		base.AudioSlot = (AudioClip)Resources.Load("Sound/Suit/inv_ruck");
		base.CostSubject = 1000;
		base.DescriptionSubject = "Однозначно заинтересует лидера Чистого Неба";
		base.WeightSubject = 0.01f;
		base.TypeSubj = TypeSubject.QuestSubject;
		base.TextOfDocument = "...Тишина. Она мягким пуховым одеялом обволакивает каждого пришедшего в Зону. Каждому известно, что в Зоне нет живых существ, кроме птиц (ворон, им, вероятно, нипочем радиация) и тех, кого лучше не поминать вслух. Впрочем, этих считать за живых можно с большой натяжкой. И они, и птицы при движении стараются не шуметь, не беспокоить тишину понапрасну. Потому что тишину в Зоне вообще лучше не беспокоить – нарушителя может ожидать наказание.\nМногие люди не переносят пребывания в Зоне – такую тишину не каждому под силу вынести.У некоторых при выходе из Зоны наблюдались психические расстройства, обострялись хронические заболевания… Находилось немало дураков, ушедших далеко вглубь Зоны без дозиметра, скафандра и оружия. Многие из них не вернулись совсем, или вернулись облученные, с белыми от пережитого ужаса волосами.\nВпрочем, из тех кто уходил на Зону с полным комплектом снаряжения, возвращались тоже далеко не все. Не проходило месяца, чтобы кто-нибудь из сталкеров не пал жертвой собственной неосторожности.Кого - то из них разорвали зомби, кого-то съели карлики. Если причиной смерти становились зомби, можно было отыскать кости, карлики же съедали и их. Кто - то умер по иным причинам...\nНе - сталкеров гибло больше. Гораздо больше.";
	}
}
