using UnityEngine;

public class TaskGlobalchemist11 : ConstructorTasks
{
	public TaskGlobalchemist11()
	{
		base.NameTask = "Путь на Болота";
		base.TextTask = "Привет брат! Прибор в безопасности, профессор его восстановит или сделает аналог по его образцу. Думаю не за горами то время, когда мутанты с ПСИ-способностями не будут доставлять столько хлопот. Теперь о делах насущных: Где-то на затоне имеется старый испытательный цех. В нем испытывали какое-то секретное оружие, невероятной мощности. Кое-кто готов заплатить серьезные деньги, чтобы узнать об этом оружии хоть какую-нибудь информацию. Один боец Чистого неба бывал в том цехе. Персонаж крайне интересный. Поговаривают, что некоторые группировки не связываются с ним, только из-за покровительства Чистого Неба. Связавшись с с ним, не удивляйся изменению репутации, но необходимо его разыскать и убедить оказать нам помощь. База ЧН где-то на Болотах, туда тебе дорога.";
		base.DescriptionTask = "Добраться до базы Чистого Неба на Болотах";
		base.QuestSubject = new AAAAAAAAAAAAAAAAAAbi();
		base.RewardSubject = new AAAAAAAAAAAAAAAAAAbi();
		base.RewardMoney = 0;
		base.ImageTask = (Texture2D)Resources.Load("Sprites/IconChar/Mehanik");
		base.NamePointTask = "База Чистого Неба";
		base.MapName = "Marsh";
	}
}
