using UnityEngine;

public class TaskAdditionalquestPathfinder2 : ConstructorTasks
{
	public TaskAdditionalquestPathfinder2()
	{
		base.NameTask = "Найти препарат: ПСИ-блокада";
		base.TextTask = "Стой сталкер... Не стреляй... Помоги...\nПодрядился я был на Янтаре, мутантов перебить, неподалеку от высохшего озера. Все в роде по плану шло, отстреливал по одному, как вдруг, со стороны завода, целая свора хоботообразных высыпала. Отбиться не получилось. Слышал я, что рядом с озером оставаться на продолжительное время крайне опасно, да выбора не было. Ринулся к островку, да на силу отстрелялся от мутантов.Там меня ПСИ-излучением из озера, видимо, и шибануло. Обессилил, в конец, земля из под ног уходит, голоса мерещатся, и тянет к центру озера, что сил нет противиться... Только и успел пачку таблеток ПСИ-блокады проглотить.\nДа видно поздно. Сколько по зоне бродил, не помню, где был не знаю, как здесь оказался, знать не ведаю. \nКак видно, от болевого шока очухался, но не протянуть мне много без ПСИ-блокады, зовет меня озеро...\nПомоги мне сталкер, принеси мне препараты, не-то сгину среди зомбированных, и дело с концом...\nПрепарат можно найти в тайнике в Логове мутантов, на свалке, ну или купить у торговцев. Мне нужно-то пара штук.";
		base.DescriptionTask = "Найти в тайнике или купить препараты: ПСИ-блокада. Доставить Препараты Следопыту.";
		base.QuestSubject = new AAAAAAAAAAAAAAAAAAAAAbq();
		base.RewardSubject = new AAAAAAAAAAAAAAAAAAbi();
		base.RewardMoney = 0;
		base.ImageTask = (Texture2D)Resources.Load("Sprites/IconChar/iconZombySuit128");
		base.AdditionalTask = true;
	}
}
