using UnityEngine;

public class TaskAdditionalMercenaryGroup0 : ConstructorTasks
{
	public TaskAdditionalMercenaryGroup0()
	{
		base.NameTask = "Пространственная аномалия";
		base.TextTask = "Привет, наемник! Мы давно наблюдаем за этой аномалией. В последнее время датчики аномальной активности здесь зашкаливают. У местечка и так дурная слава, а после того как здесь стали пропадать сталкеры, крайне мало смельчаков решаются заглядывать сюда. И действительно, как показывают наши исследования, ни то что в аномалии, но и рядом с ней, стало находиться крайне опасно.\nОтряда наемников мы здесь не видели, но наша радиостанция постоянно транслирует запросы о помощи. Так вот ведь еще какая штука! Стоит перенести радиостанцию на сто метров подальше, так радиосигнал тут же пропадает.\nНаши исследования показывают, что в двух метрах над танком, имеется скопление до этого неизвестной формы материи. С помощью сконструированного нами оборудования, мы можем, расщепить эту материю. Возможно, это откроет секрет исчезновения сталкеров.\nНо вот беда, во время последнего эксперимента, часть оборудования вышла из строя, и прежде, чем мы сможем продолжить, его заменить.\nЕсли ты доставишь запасное оборудование с нашей базы на Янтаре, мы будем очень признательны, а ты возможно сможешь получить информацию о своей группе.";
		base.DescriptionTask = "Получить: ";
		base.QuestSubject = new AAAAAAAAAAAAAAAAAAca();
		base.RewardSubject = new AAAAAAAAAAAAAAAAAAbi();
		base.RewardMoney = 0;
		base.ImageTask = (Texture2D)Resources.Load("Sprites/IconChar/iconEcologGreen256");
		base.AdditionalTask = true;
		base.SubjectQuest = true;
		base.NamePointTask = "Бункер ученых";
		base.MapName = "Amber";
	}
}
